.data

    #строка для тестирования распознавания палиндромов
    test_str:
        .string "abacaba\n"

.text

/******************************************************************
    Выводит строку, находящуюся в %eax, в stdout
******************************************************************/
.type print_str, @function

print_str:
    pushl %eax
    call printf
    popl %eax
    ret
#END OF print_str


/******************************************************************
    Проверяет строку, адрес которой записан в %eax, на палиндром.
******************************************************************/
.type is_palindrome, @function

is_palindrome:
  #напечатаем обрабатываемую строку
    call print_str
    ret
#END OF is_palindrome


/******************************************************************
   Основная программа
******************************************************************/
.globl _start
.type _start, @function

_start:

  #проверка строки test_str на палиндром
    mov $test_str, %eax
    call is_palindrome

  #завершение программы
    mov $1, %eax
    mov $0, %ebx
    int $0x80
#END OF _start
